{
  "education": [
    {
      "awards_achievements": [
        "Directors Honour Roll 2017"
      ],
      "degree": "Bachelor of Computer Science (Hon)",
      "department": "School of Computer Science",
      "duration": "2016-2020",
      "school_name": "University of Windsor"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_BrejvinderDhillon",
  "highlighted_projects": [
    {
      "description": "Programmed a modified 2.5D Doom-style environment in C++ with SDL2 and Eigen. The project was used to gain experience in and understanding of computer graphics. It features various drawing and rendering techniques used to produce computed surfaces. Eigen facilitated the use of linear algebra in this project, particularly the matrix and vector manipulation. It allowed the algorithms to be optimized and leverage SDL2's potential for rapid pixel manipulation which was achieved. CMake was used to test and build the program while Emscripten integration allowed it to be deployed straight to the browser.",
      "git_url": "https://github.com/Brejvinder/Graphics-Project",
      "name": "Graphics Project"
    },
    {
      "description": "Collaborated on a Python 3 based desktop application used to streamline the management of git projects by helping users to resolve merge conflicts quickly and efficiently. This was done by facilitating quick jumping between all conflicts in a project. The app scanned the entire project and presented all the merge conflicts found in it to the user. The GUI was built with pygame and PyQT5 and allowed the merge conflicts to be directly edited within the app.",
      "git_url": "https://github.com/Tristhal/MerGit",
      "name": "Mergit"
    },
    {
      "description": "Implemented a cipher system and modded it into Minecraft's in game chat system to allow for private communication. The mod was coded in Java and built off the Forge API with Gradle being used to build and package it. the The mod is optimized for seamless intergration with automatic decrytion being achieved using keywords and allowed for more robust ciphers to be easily added in later.",
      "git_url": "https://github.com/Brejvinder/Cipher-Mod",
      "name": "Cipher Mod"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a BASH tool that allows users to monitor nodes connected in a Linux cluster by tracking the hardware specifications and resource usage of the cluster nodes. The data is collected in real-time using Linux commands and is currently being used for report generation and future planning. The Monitoring Agents on the nodes collect and send data to the centralized PSQL database on a scheduled basis via crontab over the network. The docker initialization and SQL scripts ensure the deployment of the PSQL database with a standardized schema and environment.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Implemented a Java 8 application that can Post, Show and Delete Tweets from the command line. It follows the MVC design pattern, utilizing an HTTP client library to access the Twitter REST API. JUnit and Mockito were used to test the application with dependency management being done with the Spring framework.",
        "JDBC App: Coded an implementation of CRUD (Create, Read, Update and Delete) operations on a PostgresSQL Database through the Data Access Object(DAO) design pattern in Java.",
        "Grep App: Programmed a Java 8 implementation of the Linux grep command. Specifically, it recursively searches through a specified directory for a given RegEx pattern and stores the found lines into an output file. There are two implementations, one with and without the usage of Lambda Functions and Streams. Maven and Docker were used to build, deploy and run the app."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "Developed an online stock trading simulation RESTful API that can be consumed by front-end and mobile developers, as well as traders. It retrieves stock market information and persists it into a PSQL database that can then be used to CRUD quote, trader and order data from and to the database. The application is a proof of concept designed with a microservice architecture. It follows the three-tier and MVC architecture design patterns. IEX Cloud was used as the stock information data source. SpringBoot was used to manage dependencies and PSQL was used to persist and CRUD data using DAO. Docker was used to run an instance of the PSQL database along with another image for the application which was based on the openjdk:8-alpine image. Testing was done using JUnit 4. The GUI of the RESTful API was built using Swagger.",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "In progress",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "Not started",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "Not started",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Brejvinder Singh Dhillon",
  "others": [
    {
      "bullets": [
        "Tabla \u0026 Harmonium player",
        "Badminton \u0026 Table Tennis player"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Collaborated with a small team using the Scrum framework to develop various Data Engineering projects. Projects were implemented using Java, Maven, SpringBoot, Bash, RDBMS/SQL, Git, Hadoop, Spark/Scala, and Docker within a Linux environment. Integration and unit testing was done using JUnit and Mockito.",
      "duration": "2020-present",
      "title": "Software Developer"
    },
    {
      "company": "University of Windsor Science Olympiad",
      "description": "Recruited and led a team of 6 UWindsor students to organize and run the Computer Science division of the Olympiad. The challenges were designed, revised and iteratively tested with the team.",
      "duration": "October 2017 \u0026 2018 respectively",
      "title": "Volunteer \u0026 Committee Member"
    },
    {
      "company": "North Borneo Youth Camp",
      "description": "Volunteered to help run a youth camp focused on education and cultural development for 43 children. Ensured the camps audiovisual equipment was distributed, set up and their users educated on their operation. Rotated throughout the camp to help other teams and troubleshot problems that arose throughout the camp.",
      "duration": "Summer 2017",
      "title": "Volunteer Technician"
    }
  ],
  "skills": {
    "competent": [
      "CSS",
      "PHP",
      "HTML",
      "JavaScript",
      "Python",
      "Docker"
    ],
    "familiar": [
      "Operating Systems",
      "Computer Graphics",
      "TeX",
      "x86 ASM",
      "Google Cloud Platform"
    ],
    "proficient": [
      "Java",
      "C/C++",
      "Algorithms/Data Structures",
      "Linux/BASH",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git/GitHub",
      "GitFlow",
      "Maven",
      "Springboot",
      "REST APIs"
    ]
  },
  "summary": "I'm Brejvinder, a recent graduate from the University of Windsor with a Bachelor's in Computer Science Honors. I specialize in the design and analysis of algorithms and have a foundation in theoretical computer science. I'm currently a Data Engineer at Jarvis Consulting where I'm being given the opportunity to apply my knowledge and hone my skills with industry-standard tools. I have an interest in artificial intelligence, data analytics and game theory. Despite being from a science background, I have a passion for creative arts, namely music and creative writing which translates back into my programming as I like to create beautiful and efficient code."
}
