{
  "education": [
    {
      "awards_achievements": [
        "Directors Honour Roll 2017"
      ],
      "degree": "Bachelor of Computer Science (Hon)",
      "department": "School of Computer Science",
      "duration": "2016-2020",
      "school_name": "University of Windsor"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_BrejvinderDhillon",
  "highlighted_projects": [
    {
      "description": "Programmed modified 2.5D Doom style environment used to gain experience in and understanding of computer graphics. Features various drawing and rendering techniques to produce computed surfaces. Optimized for rapid pixel manipulation through efficient algorithms. Allows for browser deployment via emscripten integration.",
      "git_url": "https://github.com/Brejvinder/Graphics-Project",
      "name": "Graphics Project"
    },
    {
      "description": "Collaborated on a desktop application used to streamline the management of git projects by helping users to resolve merge conflicts quickly and efficiently by facilitating quick jummping between all conflicts in a project.",
      "git_url": "https://github.com/Tristhal/MerGit",
      "name": "Mergit"
    },
    {
      "description": "Implemented a cipher system and modded into Minecraft's in game chat system to allow for private communication. The mod is optimized for seamless intergration with automatic decrytion being achieved using keywords.",
      "git_url": "https://github.com/Brejvinder/Cipher-Mod",
      "name": "Cipher Mod"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a tool that allows users to monitor nodes connected in a Linux cluster by tracking the hardware specifications and resource usage of the cluster nodes. The data is collected in real-time and is currently being used for report generation and future planning. The Monitoring Agents on the nodes collect and send data to the centralized database on a scheduled basis via crontab over the network. The docker initialization and SQL scripts ensure the deployment of the RDBMS with a standardized schema and environment.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Implemented an application that can Post, Show and Delete Tweets from the command line. It follows the MVC design pattern, utilizing an HTTP client library to access the Twitter REST API.",
        "JDBC App: Coded an implementation of CRUD (Create, Read, Update and Delete) operations on a PostgresSQL Database through the Data Access Object(DAO) design pattern.",
        "Grep App: Programmed an implementation of the Linux grep command. Specifically, it recursively searches through a specified directory for a given RegEx pattern and stores the found lines into an output file. There are two implementations, one with and without the usage of Lambda Functions."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "Developed an online stock trading simulation RESTful API that can be consumed by front-end and mobile developers, as well as traders. It retrieves stock market information and persists it into a database that can then be used to CRUD quote, trader and order data from and to the database.",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "In progress",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "Not started",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "Not started",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Brejvinder Singh Dhillon",
  "others": [
    {
      "bullets": [
        "Tabla \u0026 Harmonium player",
        "Badminton \u0026 Table Tennis player"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Collaborated with a small team using the Scrum framework to develop various Data Engineering projects. Projects were implemented using Java, Maven, SpringBoot, Bash, RDBMS/SQL, Git, Hadoop, Spark/Scala, and Docker within a Linux environment. Integration and unit testing was done using JUnit and Mockito.",
      "duration": "2020-present",
      "title": "Software Developer"
    },
    {
      "company": "University of Windsor Science Olympiad",
      "description": "Recruited and led a team of 6 UWindsor students to organize and run the Computer Science division of the Olympiad. The challenges were designed, revised and iteratively tested with the team.",
      "duration": "October 2017 \u0026 2018 respectively",
      "title": "Volunteer \u0026 Committee Member"
    },
    {
      "company": "North Borneo Youth Camp",
      "description": "Volunteered to help run a youth camp focused on education and cultural development for 43 children. Ensured the camps audiovisual equipment was distributed, set up and their users educated on their operation. Rotated throughout the camp to help other teams and troubleshooted problems that arose throughout the camp.",
      "duration": "Summer 2017",
      "title": "Volunteer Technician"
    }
  ],
  "skills": {
    "competent": [
      "CSS",
      "PHP",
      "HTML",
      "JavaScript",
      "Python",
      "Docker",
      "Springboot",
      "REST APIs"
    ],
    "familiar": [
      "Operating Systems",
      "Computer Graphics",
      "TeX",
      "x86 ASM",
      "Google Cloud Platform"
    ],
    "proficient": [
      "Java",
      "C/C++",
      "Algorithms/Data Structures",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git/GitHub",
      "GitFlow",
      "Maven"
    ]
  },
  "summary": "I'm Brejvinder, a recent graduate from the University of Windsor with a Bachelor's in Computer Science Honors. I specialize in the design and analysis of algorithms and have a foundation in theoretical computer science. I'm currently a Data Engineer at Jarvis Consulting where I'm being given the opportunity to apply my knowledge and hone my skills with industry-standard tools. I have an interest in artificial intelligence, data analytics and game theory. Despite being from a science background, I have a passion for creative arts, namely music and creative writing which translates back into my programing as I like to create beautiful and efficient code."
}
